{
  "LuaSnip": { "branch": "master" },
  "ack.vim": { "branch": "master" },
  "ayu-vim": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
  "candid.vim": { "branch": "master" },
  "elixir-tools.nvim": { "branch": "main" },
  "embark": { "branch": "main" },
  "emmet-vim": { "branch": "master" },
  "everforest": { "branch": "master" },
  "friendly-snippets": { "branch": "main" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "gruvbox": { "branch": "master" },
  "iceberg.vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "mini.icons": { "branch": "main" },
  "nord-vim": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "oil.nvim": { "branch": "master" },
  "onedark.vim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "rigel": { "branch": "master" },
  "sonokai": { "branch": "master" },
  "tokyonight-vim": { "branch": "master" },
  "typescript-tools.nvim": { "branch": "master" },
  "vim": { "branch": "master" },
  "vim-colors-solarized": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-projectionist": { "branch": "master" },
  "vim-sensible": { "branch": "master" },
  "vim-surround": { "branch": "master" }
}
